Revit 2026 API

# TemperatureRatingTypeRemoveInsulationType Method

---

Remove an existing insulation type from this temperature rating type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveInsulationType(
	InsulationType insulationType
)
```
```vb
Public Sub RemoveInsulationType (
	insulationType As InsulationType
)
```
```cpp
public:
void RemoveInsulationType(
	InsulationType^ insulationType
)
```
```fsharp
member RemoveInsulationType :
        insulationType : InsulationType -> unit
```

#### Parameters

insulationType InsulationType
    Insulation type to be removed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The last one insulation type of project and any one which is in use by a wire type can't be removed. |

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace